INSERT INTO questions (id, content, choices, correct_index, created_at, author_name, is_admin_only)
VALUES 
  (22, 'かずとの一番好きなジブリ作品はどれ？', '["となりのトトロ", "千と千尋の神隠し", "天空の城ラピュタ", "アナと雪の女王3"]', 1, '2026-01-03 12:41:46.348466+00', 'kazuto', false),
  (3, 'かずとの好きなじゃがりこの味はなーんだ', '["サラダ", "たらこバター", "明太チーズもんじゃ", "じゃがバター"]', 3, '2026-01-03 09:28:24.363122+00', 'kazuto', true),
  (4, 'かずとの正しい生年月日は？', '["1996/02/02", "1996/02/04", "1996/02/06", "1988/06/11"]', 0, '2026-01-03 10:02:16.5539+00', 'kazuto', true),
  (19, 'シリーズ化されてんのかよ！', '["されてる", "されてない", "最初から見て～！", "見るしかないっしょ！"]', 2, '2026-01-03 11:29:17.702571+00', 'kazuto', true),
  (6, 'かずとが麻雀で好きな役は？', '["七対子", "混一色", "三色同順", "対々和"]', 2, '2026-01-03 10:03:18.435286+00', 'kazuto', true),
  (5, 'かずとの特技は？', '["スプーン曲げ", "トランプマジック", "ルービックキューブ", "相撲"]', 2, '2026-01-03 10:02:42.445431+00', 'kazuto', true),
  (20, 'かずとは高校1年生の時何組だった？', '["2組", "5組", "6組", "5,6組"]', 3, '2026-01-03 11:31:45.211687+00', 'kazuto', true)
ON CONFLICT (id) DO UPDATE 
SET 
  content = EXCLUDED.content,
  choices = EXCLUDED.choices,
  correct_index = EXCLUDED.correct_index,
  author_name = EXCLUDED.author_name,
  is_admin_only = EXCLUDED.is_admin_only;